In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("messy_cars.csv")
df.head(5)

  Car_num      Brand        Mod    Yr    Money     Miles   Color
0  CAR001      Honda      Coupe  2022      NaN  197300.0   White
1  CAR002  Chevrolet      Coupe  2009  42065.0  119752.0    Blue
2  CAR003        BMW        SUV  2022  31557.0   53984.0     Red
3  CAR004  Chevrolet  Hatchback  2001  38763.0   45774.0  Yellow
4  CAR005  Chevrolet  Hatchback  2006  37606.0    7568.0   Green

In [ ]:
##GROUP BY & Multiple Agregations

In [6]:
# group by brand and select one column before the  agregation
brand_group = df.groupby("Brand")["Miles"].mean()
brand_group.head()

Brand
BMW          113058.8
Chevrolet     90362.6
Ford          97328.0
Honda        109335.5
Toyota        20527.0
Name: Miles, dtype: float64

In [7]:
brand_group = df.groupby("Brand")["Miles"].mean().reset_index(name="Avg_mileage")
brand_group.head()

       Brand  Avg_mileage
0        BMW     113058.8
1  Chevrolet      90362.6
2       Ford      97328.0
3      Honda     109335.5
4     Toyota      20527.0

In [13]:
# multiple aggregations on brand , money, car_num

multi_group = df.groupby("Brand").agg(
    avg_price=("Money","mean"),
    avg_mileage=("Miles","median"),
    total_cars=("Car_num","count")
).reset_index()
multi_group.head()

       Brand     avg_price  avg_mileage  total_cars
0        BMW  31653.333333     129375.0           5
1  Chevrolet  36670.250000     109488.0           5
2       Ford  29977.666667      97328.0           3
3      Honda  25653.800000     104094.0           6
4     Toyota  49629.000000      20527.0           2

In [14]:
# multiple aggregations on multiple columns

multiple_cols = df.groupby(["Mod", "Color"]).agg(
    avg_price = ("Money", "mean"),
    total_cars = ("Car_num", "count")
).reset_index()

multiple_cols.head()

           Mod  Color  avg_price  total_cars
0  Convertible   Blue    44976.0           1
1  Convertible    Red    29253.0           1
2        Coupe  Black    22905.0           2
3        Coupe   Blue    42065.0           1
4        Coupe  White        NaN           1

In [21]:
# Group by color and calculate the average milage
colour_group = df.groupby(["Color"]).agg(avg_mileage = ("Miles", "mean"))
colour_group.head(5)

# Groud by brand and calculate the maximum price
brand_group = df.groupby(["Brand"])["Money"].max()
brand_group.head(5)

# Group by brand and color and count how many cars are in each combination
brand

# Group by brand and calculate both the average milage and total monet spent in one .agg()

Brand
BMW          34127.0
Chevrolet    42065.0
Ford         44099.0
Honda        44976.0
Toyota       56214.0
Name: Money, dtype: float64